/********************************************************************************
* 文件名称：	BeepApp.h
* 作	者：	马如意   
* 当前版本：   	V1.0
* 完成日期：    2015.04.24
* 功能描述: 	定义BeepApp.h头文件
* 历史信息：   
*           	版本信息     完成时间      原作者        注释
*
*       >>>>  在工程中的位置  <<<<
*             3-应用层
*          √  2-协议层
*          	  1-硬件驱动层
*********************************************************************************
* Copyright (c) 2014,天津华宁电子有限公司 All rights reserved.
*********************************************************************************/
#ifndef __BEEPAPP_H__
#define __BEEPAPP_H__

/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"

/********************************************************************************
* #define宏定义
*********************************************************************************/
#define	BUZZER_ON()		BEEP_ON()
#define	BUZZER_OFF()	BEEP_OFF()

/********************************************************************************
* 常量定义
*********************************************************************************/

/********************************************************************************
* 全局变量声明
*********************************************************************************/

/********************************************************************************
* 函数声明
*********************************************************************************/
#define	BEEP_KEY_PRESSED		(u16)1	//按键音
#define BEEP_KEY_COUNT			(u16)1	//发声次数
#define BEEP_KEY_ON_TIMER		(u16)10	//发声时长（*10ms）
#define BEEP_KEY_OFF_TIMER		(u16)0	//间歇时长（*10ms）

#define	BEEP_NEAR_SELECTED		(u16)2	//邻/隔架选中
#define BEEP_NEAR_COUNT			(u16)0xffff	//发声次数
#define BEEP_NEAR_ON_TIMER_1ST	(u16)100	//第一次发声时长（*10ms）
#define BEEP_NEAR_ON_TIMER		(u16)60	//发声时长（*10ms）
#define BEEP_NEAR_OFF_TIMER		(u16)30	//间歇时长（*10ms）

#define	BEEP_AUTO_ACTION		(u16)3	//自动动作
#define BEEP_AUTO_COUNT			(u16)0xffff	//发声次数
#define BEEP_AUTO_ON_TIMER		(u16)100	//发声时长（*10ms）
#define BEEP_AUTO_OFF_TIMER		(u16)30	//间歇时长（*10ms）

#define	BEEP_LOCKED				(u16)4	//闭锁急停
#define BEEP_LOCKED_COUNT		(u16)2	//发声次数
#define BEEP_LOCKED_ON_TIMER	(u16)40	//发声时长（*10ms）
#define BEEP_LOCKED_OFF_TIMER	(u16)40	//间歇时长（*10ms）

#define	BEEP_UNLOCKED			(u16)5	//闭锁急停解锁
#define BEEP_UNLOCKED_COUNT		(u16)3	//发声次数
#define BEEP_UNLOCKED_ON_TIMER	(u16)40	//发声时长（*10ms）
#define BEEP_UNLOCKED_OFF_TIMER	(u16)40	//间歇时长（*10ms）

#define	BEEP_END_PRESSED		(u16)6	//停止音
#define BEEP_END_COUNT			(u16)1	//发声次数
#define BEEP_END_ON_TIMER		(u16)20	//发声时长（*10ms）
#define BEEP_END_OFF_TIMER		(u16)0	//间歇时长（*10ms）

/********************************************************************************
* 函数声明
*********************************************************************************/
void BuzzerProc(void);
void BuzzerOn(u16 u16Case);
void BuzzerOff(void);

#endif

