/********************************************************************************
* 文件名称：	IrMng.h
* 作	者：	马如意   
* 当前版本：   	V1.0
* 完成日期：    2015.04.24
* 功能描述: 	定义IrMng.h头文件
* 历史信息：   
*           	版本信息     完成时间      原作者        注释
*
*       >>>>  在工程中的位置  <<<<
*             3-应用层
*          √  2-协议层
*          	  1-硬件驱动层
*********************************************************************************
* Copyright (c) 2014,天津华宁电子有限公司 All rights reserved.
*********************************************************************************/
#ifndef __IRMNG_H__
#define __IRMNG_H__

/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"

/********************************************************************************
* #define宏定义
*********************************************************************************/
typedef	struct
{
	union
	{
		struct
		{
			unsigned int	ActType:4;		//动作类型
			unsigned int	ScNumbLow:3;	//支架控制器编号低3位
			unsigned int	Flag:1;			//标志位

			unsigned int	ScNumbHigh:6;	//支架控制器编号高6位
			unsigned int	SendDirection:1;	//发送方向
			unsigned int	Resverd:1;		//预留		
		}ID;
		u16 u16Id;
	}u16UserID;

	union
	{
		struct
		{
			unsigned int	DeviceCommFlag:1;		//设备之间通讯是否正常
			unsigned int	Ack:1;			//应答位
			unsigned int	DeviceId:4;		//设备编号
			unsigned int	ScNumbAddDirection:1;		//架号增向
			unsigned int	Resverd:1;		//预留	
			
		}DATA;
		u8 u8Data;
	}u8UserData;
	
}IR_FRAMNE_TYPE;

/**标志位类型枚举**/
enum
{
	IR_FLAG_NONE = 0,
	IR_FLAG_INVALID = 1
		
};

/**动作类型枚举**/
enum
{
	IR_ACT_INVALID = 0,
	IR_ACT_YKQ = 1,
	IR_ACT_SC = 2,
	IR_ACT_SET_YKQ_ID = 3,
	IR_ACT_SEARCH_YKQ_ID = 15		
};

/**发送方向枚举**/
enum
{
	IR_DIRECTION_YKQ = 0,
	IR_DIRECTION_SC = 1
		
};

/**应答位枚举**/
enum
{
	IR_ACK_NONE = 0,
	IR_ACK = 1
};

/**通讯正常枚举**/
enum
{
	IR_COMM_STATUS_ASK = 0,
	IR_COMM_STATUS_ANSWER = 1,
};

/********************************************************************************
* 常量定义
*********************************************************************************/

/********************************************************************************
* 全局变量声明
*********************************************************************************/

/********************************************************************************
* 函数声明
*********************************************************************************/

/********************************************************************************
* 函数声明
*********************************************************************************/
u32 IrSendCalibrateCodeInterface(u8 u8Ykq_id);
u32 IrSendSearchYkqCodeInterface(u8 u8Ykq_id);
u32 IrSendSetYkqIdCodeInterface(u8 u8Ykq_id);
void IrMng_Task(void *p_arg);
#endif

