/********************************************************************************
* 文件名称：	input.c
* 作	者：	马如意   
* 当前版本：   	V1.0
* 完成日期：    2014.11.28
* 功能描述: 	完成输入口的驱动，实现设备初始化、数据读写等操作。
* 历史信息：   
*           	版本信息     完成时间      原作者        注释
*
*       >>>>  在工程中的位置  <<<<
*          	  3-应用层
*             2-协议层
*          √  1-硬件驱动层
*********************************************************************************
* Copyright (c) 2014,天津华宁电子有限公司 All rights reserved.
*********************************************************************************/
/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"

/********************************************************************************
* #define宏定义
*********************************************************************************/

/********************************************************************************
* 常量定义
*********************************************************************************/

/********************************************************************************
* 变量定义
*********************************************************************************/

/********************************************************************************
* 函数定义
*********************************************************************************/
/*******************************************************************************************
**函数名称：InputInit
**函数作用：Input初始化
**函数参数：无
**函数输出：无
**注意事项：无
*******************************************************************************************/
u32	InputInit(void)
{
	GPIO_InitTypeDef  GPIO_InitStructure;

	/* Input clocks enable */
	RCC_AHBPeriphClockCmd(RCC_INPUT_WAKEUP1_GPIO, ENABLE);	  //使能时钟
	
	/* Configure INPUT pin */																	
	GPIO_InitStructure.GPIO_Pin = INPUT_WAKEUP1_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(INPUT_WAKEUP1_PORT, &GPIO_InitStructure);
	
	return 0x01;	
}

/*******************************************************************************************
**函数名称：InputGetValue
**函数作用：Input获取输入点数值
**函数参数：无
**函数输出：无
**注意事项：无
*******************************************************************************************/
u32 InputGetValue(INPUT_CHANNEL_TYPE channel, INPUT_VALUE_TYPE *sValue)
{
	u32 u32returnvalue = 0x00;
	
	switch(channel)
	{
		case INPUT_1:
			*sValue = (INPUT_VALUE_TYPE)GPIO_ReadInputDataBit(INPUT_WAKEUP1_PORT, INPUT_WAKEUP1_PIN);
			u32returnvalue  = 0x01;
			break;
				
		default:
			u32returnvalue  = 0x00;
			break;
	}
	
	return u32returnvalue;
}
