/********************************************************************************
* 文件名称：	uart.h
* 作	者：  
* 当前版本：   	V1.0
* 完成日期：    2015.04.24
* 功能描述: 	定义bsp.h头文件
* 历史信息：   
*           	版本信息     完成时间      原作者        注释
*
*       >>>>  在工程中的位置  <<<<
*             3-应用层
*          	  2-协议层
*          √  1-硬件驱动层
*********************************************************************************
* Copyright (c) 2014,天津华宁电子有限公司 All rights reserved.
*********************************************************************************/
#ifndef __UART1_H__ 
#define __UART1_H__

/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"
/********************************************************************************
* #define宏定义
*********************************************************************************/

extern OS_EVENT  *s_stUsartRecvd;	//无线模块串口接收信号量
/********************************************************************************
* 常量定义
*********************************************************************************/
#define	 USART_SEND_CHAR_INTERVAL			  	  10//发送数据时，两字符之间的间隔(以OS时钟周期为单位)。此处为9600，估算最大值
#define  USARTSENDBUFSIZE          128
/********************************************************************************
* 全局变量声明
*********************************************************************************/

#define USART_YKQ_ADDRESS   2
#define USART_WL_ADDRESS   3


//串口数据结构体
typedef  struct
{
	uint8_t  Address;       //设备地址
	uint8_t  Serial;        //流水号
	uint8_t  FrameType;     //帧类别
	uint8_t  ACK;           //应答
	uint8_t  u8DLC;         //数据长度
	uint8_t  SendBuf[USARTSENDBUFSIZE];      //数据
	uint8_t  CRCHigh;         //CRC校验 高字节
	uint8_t  CRCLow;       //CRC校验  低字节
} stUSARTDATA;

/********************************************************************************
* 函数声明
*********************************************************************************/
u32 Usart_GetFrame(stUSARTDATA *UsartcvFrm);
void Crc16UsartSendChick(const u8 *u8Buf, u32 u32Len, u16 *u16CheckOld);
void WlUsartInit(void);

#endif


