/********************************************************************************
* 文件名：	zzz.c
* 作者：	马如意   
* 版本：   	v1.0
* 日期：    2013.12.12  
* 功能描述:  定义ZZZ数组，用于在bootloader中备份应用程序时，判定应用程序的结束。
* 修改说明：   
*
*       >>>>  在工程中的位置  <<<<
*          √  3-应用层
*             2-协议层
*             1-硬件驱动层
*********************************************************************************
* @copy
* <h2><center>&copy; COPYRIGHT 天津华宁电子有限公司 研发中心 软件部</center></h2>
*********************************************************************************/
/********************************************************************************
* .h头文件
*********************************************************************************/
#include "includes.h"
/********************************************************************************
* #define宏定义
*********************************************************************************/

/********************************************************************************
* 常量定义
*********************************************************************************/
/*定义的特殊标志,用于判断应用程序即将结束**/
#if (ONLINE_UPDATE_SELF_PRG_PT_FLAG	!=	DISABLED)
	#if (THE_DEV_TYPE == SC_DEV_TYPE)//当为支架控制器时的特殊情况
		#ifndef DYK_SS
			const char zzz[20] =
								{
								0xEE,0xEE,0xEE,0xEE,//支架控制器即将结束标志
								0xFF,0xFF,0xFF,0xFF,
								(u8)(SC_DEV_TYPE&0xFF),(u8)(SC_DEV_TYPE&0xFF),(u8)(SC_DEV_TYPE&0xFF),(u8)(SC_DEV_TYPE&0xFF),
								0xFF,0xFF,0xFF,0xFF,
								0xEE,0xEE,0xEE,0xEE,
								};
		#else
			const char zzz[20] =
								{
								0xEE,0xEE,0xEE,0xEE,//支架服务器即将结束标志
								0xFF,0xFF,0xFF,0xFF,
								(u8)(SS_DEV_TYPE&0xFF),(u8)(SS_DEV_TYPE&0xFF),(u8)(SS_DEV_TYPE&0xFF),(u8)(SS_DEV_TYPE&0xFF),	
								0xFF,0xFF,0xFF,0xFF,
								0xEE,0xEE,0xEE,0xEE,
								};
		#endif	
	#else //其他设备与设备类型相同
		const  char  zzz[20] = 
								{
								0xEE,0xEE,0xEE,0xEE,//支架控制器即将结束标志
								0xFF,0xFF,0xFF,0xFF,
								(u8)(THE_DEV_TYPE&0xFF),(u8)(THE_DEV_TYPE&0xFF),(u8)(THE_DEV_TYPE&0xFF),(u8)(THE_DEV_TYPE&0xFF),
								0xFF,0xFF,0xFF,0xFF,
								0xEE,0xEE,0xEE,0xEE,
								};	
	#endif	
#endif						
/********************************************************************************
* 变量定义
*********************************************************************************/

/********************************************************************************
* 函数声明
*********************************************************************************/
void ZZZ_Init(void)
{
	char i=0x00;	
	
	i = zzz[0x00];	
	i = 0x00; 
}
